intrepidcs/FIRE2_BLE_NRF51/nrf51822_memmap.h
#ifndef _NRF51822_S130_MEMMAP_H
#define _NRF51822_S130_MEMMAP_H

#include "nrf_mbr.h"
#include "nrf_sdm.h"

// NRF51822 MBR Section 4KB
#define MBR_START (0)
#define MBR_END (0x1000)
#define MBR_MAX_SIZE (MBR_END - MBR_START)

// NRF51822 Bootloader Settings 4KB
#define BOOTLOADER_SETTINGS_START	(0x3F000)
#define BOOTLOADER_SETTINGS_END		(0x40000)
#define BOOTLOADER_SETTINGS_MAX_SIZE	(BOOTLOADER_SETTINGS_END - BOOTLOADER_SETTINGS_START)

// NRF51822 Bootloader MBR Parameter Storage 4KB
#define BOOTLOADER_MBRPARAM_START	(0x3E000)
#define BOOTLOADER_MBRPARAM_END		(0x3F000)
#define BOOTLOADER_MBRPARAM_MAX_SIZE	(BOOTLOADER_MBRPARAM_END - BOOTLOADER_MBRPARAM_START)

// NRF51822 Bootloader Region including MBR Param 28KB
#define BOOTLOADER_REGION_START		(0x38000)
#define BOOTLOADER_REGION_END		(0x3F000)
#define BOOTLOADER_MAX_SIZE			(BOOTLOADER_REGION_END - BOOTLOADER_REGION_START)

// NRF51822 Application Area 116KB
#define APPLICATION_ADDRESS_START   (0x1B000)
#define APPLICATION_ADDRESS_END		(0x38000)
#define APPLICATION_MAX_SIZE		(APPLICATION_ADDRESS_END - APPLICATION_ADDRESS_START)

// NRF51822 Softdevice Area 108KB includes 4KB MBR
#define SD_ADDRESS_START			(0x1000)
#define SD_ADDRESS_END				(0x1B000)
#define SD_MAX_SIZE					(SD_ADDRESS_END - SD_ADDRESS_START)

// NRF51822 FLASH 256KB / 4KB Pages / 512B Blocks
#define NRF51822_FLASHSIZE			(256 * 1024)
#define NRF51822_PAGESIZE			(4096)
#define NRF51822_BLOCKSIZE			(512)
#define FIRMWARE_LAST_BLOCK_INDEX	(446 * 512) // 4096 byte sectors, 447 is bootloader

#endif // _NRF51822_S130_MEMMAP_H
